zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_GLOBAL.h
#define TMR_GLOBAL_HBTOR2_HWM_COL_MASK           (0xF0000U)
#define TMR_GLOBAL_HBTOR2_HWM_COL_SHIFT          (16U)
#define TMR_GLOBAL_HBTOR2_HWM_COL_WIDTH          (4U)
#define TMR_GLOBAL_HBTOR2_HWM_COL(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HBTOR2_HWM_COL_SHIFT)) & TMR_GLOBAL_HBTOR2_HWM_COL_MASK)
/*! @} */

/*! @name SMERBCAPR - Shared memory ENETC receive buffer capability register */
/*! @{ */

#define TMR_GLOBAL_SMERBCAPR_THRESH_MASK         (0xFFFFFFU)
#define TMR_GLOBAL_SMERBCAPR_THRESH_SHIFT        (0U)
#define TMR_GLOBAL_SMERBCAPR_THRESH_WIDTH        (24U)
#define TMR_GLOBAL_SMERBCAPR_THRESH(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_SMERBCAPR_THRESH_SHIFT)) & TMR_GLOBAL_SMERBCAPR_THRESH_MASK)

#define TMR_GLOBAL_SMERBCAPR_WORD_SIZE_MASK      (0x30000000U)
#define TMR_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT     (28U)
#define TMR_GLOBAL_SMERBCAPR_WORD_SIZE_WIDTH     (2U)
#define TMR_GLOBAL_SMERBCAPR_WORD_SIZE(x)        (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT)) & TMR_GLOBAL_SMERBCAPR_WORD_SIZE_MASK)

#define TMR_GLOBAL_SMERBCAPR_MLOC_MASK           (0xC0000000U)
#define TMR_GLOBAL_SMERBCAPR_MLOC_SHIFT          (30U)
#define TMR_GLOBAL_SMERBCAPR_MLOC_WIDTH          (2U)
#define TMR_GLOBAL_SMERBCAPR_MLOC(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_SMERBCAPR_MLOC_SHIFT)) & TMR_GLOBAL_SMERBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMERBOR0 - Shared memory ENETC receive buffer operational register 0 */
/*! @{ */

#define TMR_GLOBAL_SMERBOR0_AMOUNT_MASK          (0xFFFFFFU)
#define TMR_GLOBAL_SMERBOR0_AMOUNT_SHIFT         (0U)
#define TMR_GLOBAL_SMERBOR0_AMOUNT_WIDTH         (24U)
#define TMR_GLOBAL_SMERBOR0_AMOUNT(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_SMERBOR0_AMOUNT_SHIFT)) & TMR_GLOBAL_SMERBOR0_AMOUNT_MASK)
/*! @} */

/*! @name SMERBOR1 - Shared memory ENETC receive buffer operational 1 */
/*! @{ */

#define TMR_GLOBAL_SMERBOR1_WATERMARK_MASK       (0xFFFFFFU)
#define TMR_GLOBAL_SMERBOR1_WATERMARK_SHIFT      (0U)
#define TMR_GLOBAL_SMERBOR1_WATERMARK_WIDTH      (24U)
#define TMR_GLOBAL_SMERBOR1_WATERMARK(x)         (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_SMERBOR1_WATERMARK_SHIFT)) & TMR_GLOBAL_SMERBOR1_WATERMARK_MASK)
/*! @} */

/*! @name PCEOR - PCE 0 operational register */
/*! @{ */

#define TMR_GLOBAL_PCEOR_NUM_FRAMES_MASK         (0x7FU)
#define TMR_GLOBAL_PCEOR_NUM_FRAMES_SHIFT        (0U)
#define TMR_GLOBAL_PCEOR_NUM_FRAMES_WIDTH        (7U)
#define TMR_GLOBAL_PCEOR_NUM_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_PCEOR_NUM_FRAMES_SHIFT)) & TMR_GLOBAL_PCEOR_NUM_FRAMES_MASK)

#define TMR_GLOBAL_PCEOR_HWM_FRAMES_MASK         (0x7F00U)
#define TMR_GLOBAL_PCEOR_HWM_FRAMES_SHIFT        (8U)
#define TMR_GLOBAL_PCEOR_HWM_FRAMES_WIDTH        (7U)
#define TMR_GLOBAL_PCEOR_HWM_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_PCEOR_HWM_FRAMES_SHIFT)) & TMR_GLOBAL_PCEOR_HWM_FRAMES_MASK)

#define TMR_GLOBAL_PCEOR_MAX_FRAMES_MASK         (0x7F0000U)
#define TMR_GLOBAL_PCEOR_MAX_FRAMES_SHIFT        (16U)
#define TMR_GLOBAL_PCEOR_MAX_FRAMES_WIDTH        (7U)
#define TMR_GLOBAL_PCEOR_MAX_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_PCEOR_MAX_FRAMES_SHIFT)) & TMR_GLOBAL_PCEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name RFEOR - Replication Forwarding Engine 0 operational register */
/*! @{ */

#define TMR_GLOBAL_RFEOR_NUM_FRAMES_MASK         (0x3FU)
#define TMR_GLOBAL_RFEOR_NUM_FRAMES_SHIFT        (0U)
#define TMR_GLOBAL_RFEOR_NUM_FRAMES_WIDTH        (6U)
#define TMR_GLOBAL_RFEOR_NUM_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RFEOR_NUM_FRAMES_SHIFT)) & TMR_GLOBAL_RFEOR_NUM_FRAMES_MASK)

#define TMR_GLOBAL_RFEOR_HWM_FRAMES_MASK         (0x3F00U)
#define TMR_GLOBAL_RFEOR_HWM_FRAMES_SHIFT        (8U)
#define TMR_GLOBAL_RFEOR_HWM_FRAMES_WIDTH        (6U)
#define TMR_GLOBAL_RFEOR_HWM_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RFEOR_HWM_FRAMES_SHIFT)) & TMR_GLOBAL_RFEOR_HWM_FRAMES_MASK)

#define TMR_GLOBAL_RFEOR_MAX_FRAMES_MASK         (0x3F0000U)
#define TMR_GLOBAL_RFEOR_MAX_FRAMES_SHIFT        (16U)
#define TMR_GLOBAL_RFEOR_MAX_FRAMES_WIDTH        (6U)
#define TMR_GLOBAL_RFEOR_MAX_FRAMES(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RFEOR_MAX_FRAMES_SHIFT)) & TMR_GLOBAL_RFEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name NETCCLKR - NETC clock register */
/*! @{ */

#define TMR_GLOBAL_NETCCLKR_FREQ_MASK            (0x7FFU)
#define TMR_GLOBAL_NETCCLKR_FREQ_SHIFT           (0U)
#define TMR_GLOBAL_NETCCLKR_FREQ_WIDTH           (11U)
#define TMR_GLOBAL_NETCCLKR_FREQ(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_NETCCLKR_FREQ_SHIFT)) & TMR_GLOBAL_NETCCLKR_FREQ_MASK)
/*! @} */

/*! @name HTACAPR - HTA 0 capability register */
/*! @{ */

#define TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK    (0xFFU)
#define TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT   (0U)
#define TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES_WIDTH   (8U)
#define TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES(x)      (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT)) & TMR_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK)

#define TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK    (0xFF00U)
#define TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT   (8U)
#define TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES_WIDTH   (8U)
#define TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES(x)      (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT)) & TMR_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK)
/*! @} */

/*! @name HTARFCOR - HTA 0 receive frame count operational register */
/*! @{ */

#define TMR_GLOBAL_HTARFCOR_HP_COUNT_MASK        (0xFFU)
#define TMR_GLOBAL_HTARFCOR_HP_COUNT_SHIFT       (0U)
#define TMR_GLOBAL_HTARFCOR_HP_COUNT_WIDTH       (8U)
#define TMR_GLOBAL_HTARFCOR_HP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTARFCOR_HP_COUNT_SHIFT)) & TMR_GLOBAL_HTARFCOR_HP_COUNT_MASK)

#define TMR_GLOBAL_HTARFCOR_HP_HWM_MASK          (0xFF00U)
#define TMR_GLOBAL_HTARFCOR_HP_HWM_SHIFT         (8U)
#define TMR_GLOBAL_HTARFCOR_HP_HWM_WIDTH         (8U)
#define TMR_GLOBAL_HTARFCOR_HP_HWM(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTARFCOR_HP_HWM_SHIFT)) & TMR_GLOBAL_HTARFCOR_HP_HWM_MASK)

#define TMR_GLOBAL_HTARFCOR_LP_COUNT_MASK        (0xFF0000U)
#define TMR_GLOBAL_HTARFCOR_LP_COUNT_SHIFT       (16U)
#define TMR_GLOBAL_HTARFCOR_LP_COUNT_WIDTH       (8U)
#define TMR_GLOBAL_HTARFCOR_LP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTARFCOR_LP_COUNT_SHIFT)) & TMR_GLOBAL_HTARFCOR_LP_COUNT_MASK)

