zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_GLOBAL.h
#define TMR_GLOBAL_HTARFCOR_LP_HWM_MASK          (0xFF000000U)
#define TMR_GLOBAL_HTARFCOR_LP_HWM_SHIFT         (24U)
#define TMR_GLOBAL_HTARFCOR_LP_HWM_WIDTH         (8U)
#define TMR_GLOBAL_HTARFCOR_LP_HWM(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTARFCOR_LP_HWM_SHIFT)) & TMR_GLOBAL_HTARFCOR_LP_HWM_MASK)
/*! @} */

/*! @name HTAHPBCOR - HTA 0 high priority byte count operational register */
/*! @{ */

#define TMR_GLOBAL_HTAHPBCOR_HP_COUNT_MASK       (0xFFFFU)
#define TMR_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT      (0U)
#define TMR_GLOBAL_HTAHPBCOR_HP_COUNT_WIDTH      (16U)
#define TMR_GLOBAL_HTAHPBCOR_HP_COUNT(x)         (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT)) & TMR_GLOBAL_HTAHPBCOR_HP_COUNT_MASK)

#define TMR_GLOBAL_HTAHPBCOR_HWM_MASK            (0xFFFF0000U)
#define TMR_GLOBAL_HTAHPBCOR_HWM_SHIFT           (16U)
#define TMR_GLOBAL_HTAHPBCOR_HWM_WIDTH           (16U)
#define TMR_GLOBAL_HTAHPBCOR_HWM(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTAHPBCOR_HWM_SHIFT)) & TMR_GLOBAL_HTAHPBCOR_HWM_MASK)
/*! @} */

/*! @name HTALPBCOR - HTA 0 low priority byte count operational register */
/*! @{ */

#define TMR_GLOBAL_HTALPBCOR_LP_COUNT_MASK       (0xFFFFU)
#define TMR_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT      (0U)
#define TMR_GLOBAL_HTALPBCOR_LP_COUNT_WIDTH      (16U)
#define TMR_GLOBAL_HTALPBCOR_LP_COUNT(x)         (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT)) & TMR_GLOBAL_HTALPBCOR_LP_COUNT_MASK)

#define TMR_GLOBAL_HTALPBCOR_HWM_MASK            (0xFFFF0000U)
#define TMR_GLOBAL_HTALPBCOR_HWM_SHIFT           (16U)
#define TMR_GLOBAL_HTALPBCOR_HWM_WIDTH           (16U)
#define TMR_GLOBAL_HTALPBCOR_HWM(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTALPBCOR_HWM_SHIFT)) & TMR_GLOBAL_HTALPBCOR_HWM_MASK)
/*! @} */

/*! @name HTATFCOR - HTA 0 transmit frame count operational register */
/*! @{ */

#define TMR_GLOBAL_HTATFCOR_HP_COUNT_MASK        (0xFFU)
#define TMR_GLOBAL_HTATFCOR_HP_COUNT_SHIFT       (0U)
#define TMR_GLOBAL_HTATFCOR_HP_COUNT_WIDTH       (8U)
#define TMR_GLOBAL_HTATFCOR_HP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTATFCOR_HP_COUNT_SHIFT)) & TMR_GLOBAL_HTATFCOR_HP_COUNT_MASK)

#define TMR_GLOBAL_HTATFCOR_HP_HWM_MASK          (0xFF00U)
#define TMR_GLOBAL_HTATFCOR_HP_HWM_SHIFT         (8U)
#define TMR_GLOBAL_HTATFCOR_HP_HWM_WIDTH         (8U)
#define TMR_GLOBAL_HTATFCOR_HP_HWM(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTATFCOR_HP_HWM_SHIFT)) & TMR_GLOBAL_HTATFCOR_HP_HWM_MASK)

#define TMR_GLOBAL_HTATFCOR_LP_COUNT_MASK        (0xFF0000U)
#define TMR_GLOBAL_HTATFCOR_LP_COUNT_SHIFT       (16U)
#define TMR_GLOBAL_HTATFCOR_LP_COUNT_WIDTH       (8U)
#define TMR_GLOBAL_HTATFCOR_LP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTATFCOR_LP_COUNT_SHIFT)) & TMR_GLOBAL_HTATFCOR_LP_COUNT_MASK)

#define TMR_GLOBAL_HTATFCOR_LP_HWM_MASK          (0xFF000000U)
#define TMR_GLOBAL_HTATFCOR_LP_HWM_SHIFT         (24U)
#define TMR_GLOBAL_HTATFCOR_LP_HWM_WIDTH         (8U)
#define TMR_GLOBAL_HTATFCOR_LP_HWM(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_HTATFCOR_LP_HWM_SHIFT)) & TMR_GLOBAL_HTATFCOR_LP_HWM_MASK)
/*! @} */

/*! @name RCSBRLAR - Root complex 0 system bus read latency average register */
/*! @{ */

#define TMR_GLOBAL_RCSBRLAR_FRACT_MASK           (0xFFU)
#define TMR_GLOBAL_RCSBRLAR_FRACT_SHIFT          (0U)
#define TMR_GLOBAL_RCSBRLAR_FRACT_WIDTH          (8U)
#define TMR_GLOBAL_RCSBRLAR_FRACT(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBRLAR_FRACT_SHIFT)) & TMR_GLOBAL_RCSBRLAR_FRACT_MASK)

#define TMR_GLOBAL_RCSBRLAR_INT_MASK             (0xFFF00U)
#define TMR_GLOBAL_RCSBRLAR_INT_SHIFT            (8U)
#define TMR_GLOBAL_RCSBRLAR_INT_WIDTH            (12U)
#define TMR_GLOBAL_RCSBRLAR_INT(x)               (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBRLAR_INT_SHIFT)) & TMR_GLOBAL_RCSBRLAR_INT_MASK)
/*! @} */

/*! @name RCSBRLHWMR - Root complex 0 system bus read latency high watermark register */
/*! @{ */

#define TMR_GLOBAL_RCSBRLHWMR_FRACT_MASK         (0xFFU)
#define TMR_GLOBAL_RCSBRLHWMR_FRACT_SHIFT        (0U)
#define TMR_GLOBAL_RCSBRLHWMR_FRACT_WIDTH        (8U)
#define TMR_GLOBAL_RCSBRLHWMR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & TMR_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define TMR_GLOBAL_RCSBRLHWMR_INT_MASK           (0xFFF00U)
#define TMR_GLOBAL_RCSBRLHWMR_INT_SHIFT          (8U)
#define TMR_GLOBAL_RCSBRLHWMR_INT_WIDTH          (12U)
#define TMR_GLOBAL_RCSBRLHWMR_INT(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & TMR_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define TMR_GLOBAL_RCSBWLAR_FRACT_MASK           (0xFFU)
#define TMR_GLOBAL_RCSBWLAR_FRACT_SHIFT          (0U)
#define TMR_GLOBAL_RCSBWLAR_FRACT_WIDTH          (8U)
#define TMR_GLOBAL_RCSBWLAR_FRACT(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & TMR_GLOBAL_RCSBWLAR_FRACT_MASK)

#define TMR_GLOBAL_RCSBWLAR_INT_MASK             (0xFFF00U)
#define TMR_GLOBAL_RCSBWLAR_INT_SHIFT            (8U)
#define TMR_GLOBAL_RCSBWLAR_INT_WIDTH            (12U)
#define TMR_GLOBAL_RCSBWLAR_INT(x)               (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBWLAR_INT_SHIFT)) & TMR_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define TMR_GLOBAL_RCSBWLHWMR_FRACT_MASK         (0xFFU)
#define TMR_GLOBAL_RCSBWLHWMR_FRACT_SHIFT        (0U)
#define TMR_GLOBAL_RCSBWLHWMR_FRACT_WIDTH        (8U)
#define TMR_GLOBAL_RCSBWLHWMR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & TMR_GLOBAL_RCSBWLHWMR_FRACT_MASK)

#define TMR_GLOBAL_RCSBWLHWMR_INT_MASK           (0xFFF00U)
#define TMR_GLOBAL_RCSBWLHWMR_INT_SHIFT          (8U)
#define TMR_GLOBAL_RCSBWLHWMR_INT_WIDTH          (12U)
#define TMR_GLOBAL_RCSBWLHWMR_INT(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & TMR_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define TMR_GLOBAL_IPBRR0_IP_MN_MASK             (0xFFU)
#define TMR_GLOBAL_IPBRR0_IP_MN_SHIFT            (0U)
#define TMR_GLOBAL_IPBRR0_IP_MN_WIDTH            (8U)
#define TMR_GLOBAL_IPBRR0_IP_MN(x)               (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_IPBRR0_IP_MN_SHIFT)) & TMR_GLOBAL_IPBRR0_IP_MN_MASK)

