zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_GLOBAL.h
#define TMR_GLOBAL_IPBRR0_IP_MJ_MASK             (0xFF00U)
#define TMR_GLOBAL_IPBRR0_IP_MJ_SHIFT            (8U)
#define TMR_GLOBAL_IPBRR0_IP_MJ_WIDTH            (8U)
#define TMR_GLOBAL_IPBRR0_IP_MJ(x)               (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & TMR_GLOBAL_IPBRR0_IP_MJ_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

#define TMR_GLOBAL_IPBRR1_IP_CFG_MASK            (0xFFU)
#define TMR_GLOBAL_IPBRR1_IP_CFG_SHIFT           (0U)
#define TMR_GLOBAL_IPBRR1_IP_CFG_WIDTH           (8U)
#define TMR_GLOBAL_IPBRR1_IP_CFG(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & TMR_GLOBAL_IPBRR1_IP_CFG_MASK)

#define TMR_GLOBAL_IPBRR1_IP_MNT_MASK            (0xFF00U)
#define TMR_GLOBAL_IPBRR1_IP_MNT_SHIFT           (8U)
#define TMR_GLOBAL_IPBRR1_IP_MNT_WIDTH           (8U)
#define TMR_GLOBAL_IPBRR1_IP_MNT(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & TMR_GLOBAL_IPBRR1_IP_MNT_MASK)

#define TMR_GLOBAL_IPBRR1_IP_INT_MASK            (0xFF0000U)
#define TMR_GLOBAL_IPBRR1_IP_INT_SHIFT           (16U)
#define TMR_GLOBAL_IPBRR1_IP_INT_WIDTH           (8U)
#define TMR_GLOBAL_IPBRR1_IP_INT(x)              (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_IPBRR1_IP_INT_SHIFT)) & TMR_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define TMR_GLOBAL_FBLPR_PARAM_VAL_MASK          (0xFFFFFFFFU)
#define TMR_GLOBAL_FBLPR_PARAM_VAL_SHIFT         (0U)
#define TMR_GLOBAL_FBLPR_PARAM_VAL_WIDTH         (32U)
#define TMR_GLOBAL_FBLPR_PARAM_VAL(x)            (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & TMR_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/*! @name TUFSBECR - Timer uncorrectable fatal system bus error configuration register */
/*! @{ */

#define TMR_GLOBAL_TUFSBECR_RD_MASK              (0x80000000U)
#define TMR_GLOBAL_TUFSBECR_RD_SHIFT             (31U)
#define TMR_GLOBAL_TUFSBECR_RD_WIDTH             (1U)
#define TMR_GLOBAL_TUFSBECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_TUFSBECR_RD_SHIFT)) & TMR_GLOBAL_TUFSBECR_RD_MASK)
/*! @} */

/*! @name TUFSBESR - Timer uncorrectable fatal system bus error status register */
/*! @{ */

#define TMR_GLOBAL_TUFSBESR_SB_ID_MASK           (0xFU)
#define TMR_GLOBAL_TUFSBESR_SB_ID_SHIFT          (0U)
#define TMR_GLOBAL_TUFSBESR_SB_ID_WIDTH          (4U)
#define TMR_GLOBAL_TUFSBESR_SB_ID(x)             (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_TUFSBESR_SB_ID_SHIFT)) & TMR_GLOBAL_TUFSBESR_SB_ID_MASK)

#define TMR_GLOBAL_TUFSBESR_M_MASK               (0x40000000U)
#define TMR_GLOBAL_TUFSBESR_M_SHIFT              (30U)
#define TMR_GLOBAL_TUFSBESR_M_WIDTH              (1U)
#define TMR_GLOBAL_TUFSBESR_M(x)                 (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_TUFSBESR_M_SHIFT)) & TMR_GLOBAL_TUFSBESR_M_MASK)

#define TMR_GLOBAL_TUFSBESR_SBE_MASK             (0x80000000U)
#define TMR_GLOBAL_TUFSBESR_SBE_SHIFT            (31U)
#define TMR_GLOBAL_TUFSBESR_SBE_WIDTH            (1U)
#define TMR_GLOBAL_TUFSBESR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << TMR_GLOBAL_TUFSBESR_SBE_SHIFT)) & TMR_GLOBAL_TUFSBESR_SBE_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group TMR_GLOBAL_Register_Masks */

/*!
 * @}
 */ /* end of group TMR_GLOBAL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_TMR_GLOBAL_H_) */
